Revit 2024 API
MEPAnalyticalSegment.Roughness Property
 The roughness of this segment, in ft.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double Roughness { get; }
Visual Basic
Public ReadOnly Property Roughness As Double
	Get
Visual C++
public:
property double Roughness {
	double get ();
}
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace